{
  "histogram_chart": [
    "Histogram of FIELD",
    "Show me a histogram for FIELD",
    "Can you display a histogram of FIELD data?",
    "I want to see a histogram illustrating the distribution of FIELD",
    "Generate a histogram chart for the FIELD variable, please",
    "Plot a histogram for the values in FIELD",
    "Display a histogram graph for the FIELD column",
    "I'm interested in visualizing a histogram for the data in FIELD",
    "Could you provide a histogram chart for the FIELD attribute?",
    "Show the distribution with a histogram for FIELD",
    "I need a histogram depicting the values in the FIELD column",
    "Please generate a histogram for the FIELD data set",
    "Illustrate the distribution using a histogram for FIELD",
    "Show me how the values are distributed in FIELD using a histogram",
    "I'd like to visualize the distribution, create a histogram for FIELD",
    "Plot a histogram showcasing the distribution of FIELD",
    "Generate a histogram chart for the FIELD variable in my dataset",
    "Display a histogram graph for the values in the FIELD column",
    "Can you create a histogram for the distribution of FIELD?",
    "I want to see a histogram that represents the data in FIELD",
    "Provide a histogram chart for the FIELD attribute"
  ],
  "line_chart": [
    "Line chart of FIELD_X over FIELD_Y",
    "Create a line chart showing FIELD_X against FIELD_Y",
    "I'd like to see a line chart plotting FIELD_X over FIELD_Y",
    "Show the trend using a line chart for FIELD_X and FIELD_Y",
    "Generate a line graph with FIELD_X on the x-axis and FIELD_Y on the y-axis",
    "Plot a line chart representing the relationship between FIELD_X and FIELD_Y",
    "Can you visualize the correlation between FIELD_X and FIELD_Y with a line chart?",
    "Display a line chart depicting the relationship of FIELD_X with FIELD_Y",
    "Create a line chart that illustrates the connection between FIELD_X and FIELD_Y",
    "Provide a line chart showcasing the values of FIELD_X and FIELD_Y",
    "Show me the changes in FIELD_X concerning FIELD_Y using a line chart",
    "Plot FIELD_X against FIELD_Y with a line chart",
    "I want a line chart that displays the variation in FIELD_X and FIELD_Y",
    "Generate a line chart to visualize how FIELD_X and FIELD_Y are related",
    "Illustrate the correlation between FIELD_X and FIELD_Y using a line chart",
    "Display the trends in FIELD_X and FIELD_Y with a line chart",
    "Can you create a line chart to show the progression of FIELD_X and FIELD_Y?",
    "Provide a visual representation of FIELD_X and FIELD_Y using a line chart",
    "Show me a line chart for FIELD_X and FIELD_Y data points",
    "Plot a line chart for the values in FIELD_X compared to FIELD_Y"
  ],
  "bar_chart": [
    "Bar chart of FIELD_Y grouped by FIELD_X",
    "Generate a bar chart to show the distribution of FIELD_Y grouped by FIELD_X",
    "I want a bar chart illustrating how FIELD_Y is grouped by values in FIELD_X",
    "Create a bar graph displaying the relationship between FIELD_Y and grouped values of FIELD_X",
    "Display a bar chart depicting the distribution of FIELD_Y with groups based on FIELD_X",
    "Can you plot a bar chart representing the correlation between FIELD_Y and grouped FIELD_X?",
    "Provide a visual representation of how FIELD_Y varies with different groups in FIELD_X using a bar chart",
    "I'd like to see a bar chart where FIELD_Y is categorized by the values in FIELD_X",
    "Generate a bar chart that demonstrates the grouping of FIELD_Y by values in FIELD_X",
    "Plot a bar chart to visualize the distribution of FIELD_Y across different categories of FIELD_X",
    "Show me the relationship between FIELD_Y and the grouped values of FIELD_X with a bar chart",
    "Create a bar chart that breaks down FIELD_Y based on the groups formed by FIELD_X",
    "Provide a bar chart illustrating the distribution of FIELD_Y with categories defined by FIELD_X",
    "Display the variation in FIELD_Y grouped by different values in FIELD_X using a bar chart",
    "Generate a bar chart showing how FIELD_Y is distributed within each category of FIELD_X",
    "I'd like to see a bar chart representing the distribution of FIELD_Y grouped by FIELD_X values",
    "Show me a visual breakdown of FIELD_Y by the values in FIELD_X using a bar chart",
    "Create a bar chart to display the distribution of FIELD_Y with grouping based on FIELD_X",
    "Plot a bar chart showcasing the relationship between FIELD_Y and grouped values of FIELD_X"
  ],
  "pie_chart": [
    "Pie chart of FIELD_X grouped by FIELD_Y",
    "Generate a pie chart illustrating the distribution of FIELD_X based on groups in FIELD_Y",
    "I want a pie chart showing the proportion of FIELD_X values grouped by FIELD_Y",
    "Create a pie chart that visualizes the distribution of FIELD_X within different categories of FIELD_Y",
    "Show me a pie chart depicting how FIELD_X is divided across groups defined by FIELD_Y",
    "Display a pie chart illustrating the relationship between FIELD_X and grouped values of FIELD_Y",
    "Can you plot a pie chart to represent the distribution of FIELD_X within each category of FIELD_Y?",
    "Provide a visual breakdown of FIELD_X based on different groups in FIELD_Y using a pie chart",
    "I'd like to see a pie chart that shows the distribution of FIELD_X with respect to values in FIELD_Y",
    "Generate a pie chart to demonstrate how FIELD_X is distributed among various categories in FIELD_Y",
    "Plot a pie chart to visualize the proportion of FIELD_X values within each group of FIELD_Y",
    "Show me the breakdown of FIELD_X by the values in FIELD_Y using a pie chart",
    "Create a pie chart that illustrates the distribution of FIELD_X based on grouped values of FIELD_Y",
    "Provide a pie chart that showcases the relationship between FIELD_X and grouped values of FIELD_Y",
    "Display the variation in FIELD_X based on the categories defined by FIELD_Y using a pie chart",
    "Generate a pie chart showing how FIELD_X is distributed within each category of FIELD_Y",
    "I'd like to see a pie chart representing the distribution of FIELD_X grouped by values in FIELD_Y",
    "Show me a visual representation of FIELD_X grouped by FIELD_Y using a pie chart",
    "Create a pie chart to display the proportion of FIELD_X values within each category of FIELD_Y",
    "Plot a pie chart showcasing the relationship between FIELD_X and grouped values of FIELD_Y"
  ],
  "scatter_chart": [
    "Scatter chart of FIELD_X over FIELD_Y",
    "Scatter plot of FIELD_X against FIELD_Y",
    "Generate a scatter chart to visualize the relationship between FIELD_X and FIELD_Y",
    "I'd like to see a scatter chart plotting FIELD_X against FIELD_Y",
    "Create a scatter plot illustrating the correlation between FIELD_X and FIELD_Y",
    "Show me a scatter chart that displays the distribution of FIELD_X and FIELD_Y values",
    "Display a scatter chart depicting the relationship between FIELD_X and FIELD_Y",
    "Can you plot a scatter chart to represent the data points of FIELD_X and FIELD_Y?",
    "Provide a visual representation of the correlation between FIELD_X and FIELD_Y using a scatter chart",
    "Generate a scatter chart that illustrates the scatterplot of FIELD_X over FIELD_Y",
    "Plot a scatter chart to visualize the dispersion of FIELD_X against FIELD_Y",
    "Show me the correlation between FIELD_X and FIELD_Y using a scatter chart",
    "Create a scatter chart that represents the scatterplot of FIELD_X against FIELD_Y",
    "I'd like to see a scatter chart showcasing the distribution of FIELD_X and FIELD_Y",
    "Provide a scatter plot that illustrates the correlation between FIELD_X and FIELD_Y",
    "Display the variation in FIELD_X and FIELD_Y values with a scatter chart",
    "Generate a scatter chart showing the relationship between FIELD_X and FIELD_Y",
    "I'd like to see a visual representation of the data points in FIELD_X against FIELD_Y using a scatter chart",
    "Show me a scatter chart that visualizes how FIELD_X and FIELD_Y are related",
    "Create a scatter plot to display the dispersion of FIELD_X and FIELD_Y values",
    "Plot a scatter chart showcasing the correlation between FIELD_X and FIELD_Y"
  ],
  "area_chart": [
    "Area chart of FIELD_X over FIELD_Y",
    "Create an area chart showing FIELD_X against FIELD_Y",
    "I'd like to see an area chart plotting FIELD_X over FIELD_Y",
    "Show the trend using an area chart for FIELD_X and FIELD_Y",
    "Generate an area graph with FIELD_X on the x-axis and FIELD_Y on the y-axis",
    "Plot an area chart representing the relationship between FIELD_X and FIELD_Y",
    "Can you visualize the correlation between FIELD_X and FIELD_Y with an area chart?",
    "Display an area chart depicting the relationship of FIELD_X with FIELD_Y",
    "Create an area chart that illustrates the connection between FIELD_X and FIELD_Y",
    "Provide an area chart showcasing the values of FIELD_X and FIELD_Y",
    "Show me the changes in FIELD_X concerning FIELD_Y using an area chart",
    "Plot FIELD_X against FIELD_Y with an area chart",
    "I want an area chart that displays the variation in FIELD_X and FIELD_Y",
    "Generate an area chart to visualize how FIELD_X and FIELD_Y are related",
    "Illustrate the correlation between FIELD_X and FIELD_Y using an area chart",
    "Display the trends in FIELD_X and FIELD_Y with an area chart",
    "Can you create an area chart to show the progression of FIELD_X and FIELD_Y?",
    "Provide a visual representation of FIELD_X and FIELD_Y using an area chart",
    "Show me an area chart for FIELD_X and FIELD_Y data points",
    "Plot an area chart for the values in FIELD_X compared to FIELD_Y"
  ],
  "boxplot_chart": [
    "Boxplot of FIELD",
    "Generate a box plot to visualize the distribution of values in FIELD",
    "I'd like to see a boxplot chart depicting the statistical summary of FIELD",
    "Create a box plot graph to illustrate the spread and central tendency of FIELD",
    "Show me a box plot chart representing the distribution of values in FIELD",
    "Display a boxplot chart that showcases the variability in the data for FIELD",
    "Can you plot a boxplot to provide insights into the distribution of FIELD?",
    "Provide a visual representation of the statistical summary of FIELD using a boxplot",
    "I'm interested in visualizing the spread of values in FIELD, show me a boxplot chart",
    "Generate a boxplot chart that illustrates the central tendency and variability in FIELD",
    "Plot a boxplot to visualize the quartiles and outliers in the data for FIELD",
    "Show me the distribution of values in FIELD using a boxplot chart",
    "Create a boxplot chart that represents the spread and outliers in the data for FIELD",
    "I'd like to see a visual summary of the distribution in FIELD; use a boxplot chart",
    "Provide a boxplot graph to showcase the statistical details of the FIELD variable",
    "Display the spread and central tendency of values in FIELD using a boxplot chart",
    "Generate a boxplot chart showing the quartiles and outliers for FIELD",
    "I'd like to see a boxplot that provides insights into the variability of FIELD",
    "Show me a boxplot chart illustrating the statistical summary of values in FIELD",
    "Create a visual representation of the distribution in FIELD using a boxplot",
    "Plot a boxplot chart to visualize the spread and central tendency of FIELD"
  ],
  "field_distinct": [
    "How many FIELD are?",
    "How many FIELD are there?",
    "How many FIELD do we have?",
    "What FIELD are there?",
    "Which are the different FIELD?",
    "Tell me the different FIELD available",
    "Show me all the different FIELD in the data",
    "Give me the different FIELD",
    "What kind of FIELD are there?"
  ],
  "most_frequent_value_in_field": [
    "What FIELD has more ROW_NAME?",
    "Which is the FIELD that has more ROW_NAME?",
    "What is the most frequent FIELD?",
    "Which FIELD is the most frequent?",
    "Which is the FIELD with the most ROW_NAME?",
    "What is the FIELD with more ROW_NAME?",
    "What is the most repeated FIELD?",
    "Tell me which FIELD has the highest occurrence of ROW_NAME",
    "Identify the FIELD with the maximum instances of ROW_NAME",
    "What FIELD appears most frequently?",
    "Can you find the FIELD that is most common?",
    "Identify the most frequently occurring FIELD",
    "Tell me the FIELD that appears the most",
    "Which is the most common FIELD?",
    "Find the FIELD that has the highest frequency",
    "What is the most frequently appearing FIELD?",
    "Which FIELD occurs most frequently?",
    "Can you determine the most common FIELD?",
    "Tell me the FIELD that is repeated most often",
    "What is the most repeated FIELD in the dataset?",
    "Which FIELD is the most common?",
    "Tell me the FIELD that has the highest occurrence",
    "Identify the most frequent FIELD",
    "What FIELD is repeated most frequently in the dataset?"
  ],
  "least_frequent_value_in_field": [
    "What FIELD has less ROW_NAME?",
    "Which is the FIELD that has fewer ROW_NAME?",
    "What is the least frequent FIELD?",
    "Which FIELD is the least frequent?",
    "Which is the FIELD with the least ROW_NAME?",
    "What is the FIELD with fewer ROW_NAME?",
    "What is the least repeated FIELD?",
    "Tell me which FIELD has the lowest occurrence of ROW_NAME",
    "Identify the FIELD with the minimum instances of ROW_NAME",
    "What FIELD appears least frequently?",
    "Can you find the FIELD that is least common?",
    "Identify the least frequently occurring FIELD",
    "Tell me the FIELD that appears the least",
    "Which is the least common FIELD?",
    "Find the FIELD that has the lowest frequency",
    "What is the least frequently appearing FIELD?",
    "Which FIELD occurs least frequently?",
    "Can you determine the least common FIELD?",
    "What is the least repeated FIELD in the dataset?",
    "Which FIELD is the least common?",
    "Tell me the FIELD that has the lowest occurrence",
    "Identify the least frequent FIELD",
    "What FIELD is repeated least frequently in the dataset?"
  ],
  "value_frequency": [
    "How many VALUE are there?",
    "How many VALUE do we have?",
    "What is the count of occurrences for the VALUE in the dataset?",
    "How many instances of VALUE are present in the data?",
    "Can you tell me the total number of occurrences for the given VALUE?",
    "What is the frequency of the VALUE in the dataset?",
    "Provide the count of occurrences for VALUE",
    "How many times does the VALUE appear in the dataset?",
    "Tell me the total count of instances for VALUE",
    "What is the number of occurrences for the VALUE in our data?",
    "How frequently does the VALUE occur in the dataset?",
    "Can you provide the total count of VALUE?",
    "Tell me the number of occurrences for VALUE",
    "What is the total frequency of the VALUE?",
    "Provide the count of occurrences for VALUE in the dataset",
    "How many instances of the VALUE are there in our records?",
    "What is the total count of occurrences for VALUE?",
    "Tell me how many times VALUE is present in the dataset",
    "Provide the frequency of VALUE in the data",
    "What is the total number of occurrences for VALUE in our records?",
    "How many instances of VALUE are there in our dataset?",
    "Tell me the count of occurrences for the VALUE"
  ],
  "value1_vs_value2": [
    "Are there more VALUE1 or VALUE2?",
    "Are there fewer VALUE1 or VALUE2?",
    "Which is more common, VALUE1 or VALUE2?",
    "Are there a greater number of occurrences for VALUE1 or VALUE2?",
    "Is the frequency of VALUE1 higher than that of VALUE2?",
    "Are there more instances of VALUE1 compared to VALUE2?",
    "Which occurs more frequently: VALUE1 or VALUE2?",
    "Are there more records with VALUE1 than with VALUE2?",
    "Which of the two, VALUE1 or VALUE2 is more prevalent?",
    "Is VALUE1 more common than VALUE2 in the dataset?",
    "Are there fewer occurrences of VALUE1 than VALUE2?",
    "Which value, VALUE1 or VALUE2 appears more frequently?",
    "Is the occurrence of VALUE1 higher or lower than that of VALUE2?",
    "Are there more instances of VALUE2 or VALUE1 in the data?",
    "Which value, VALUE1 or VALUE2 has a higher frequency?",
    "Are there fewer records with VALUE1 than with VALUE2?",
    "Which value occurs more frequently, VALUE1 or VALUE2?",
    "Is the count of VALUE1 greater than the count of VALUE2?",
    "Are there more occurrences of VALUE1 compared to VALUE2?",
    "Which is more prevalent: VALUE1 or VALUE2?",
    "Are there fewer instances of VALUE2 than of VALUE1?"
  ],
  "select_fields_with_conditions": [
    "Who are the VALUE1?",
    "Who are the VALUE1 of VALUE2?",
    "Give me the ROW_NAME of VALUE1",
    "Give me the ROW_NAME of VALUE1 and VALUE2",
    "What is the FIELD1 of VALUE1?",
    "What is the FIELD1 of VALUE1 and VALUE2?",
    "What is the OPERATOR FIELD1?",
    "What is the OPERATOR FIELD1 of VALUE1?",
    "What is the OPERATOR FIELD1 of VALUE1 and VALUE2?",
    "Which is the NUMBER OPERATOR FIELD1?",
    "Which is the NUMBER OPERATOR FIELD1 of VALUE1?",
    "Which is the NUMBER OPERATOR FIELD1 of VALUE1 and VALUE2?",
    "Which is the ROW_NAME with the OPERATOR FIELD1?",
    "Which is the ROW_NAME with the OPERATOR FIELD1 of VALUE1?",
    "Which is the ROW_NAME with the OPERATOR FIELD1 of VALUE1 and VALUE2?",
    "Show me the NUMBER ROW_NAME with the OPERATOR FIELD1",
    "Show me the NUMBER ROW_NAME with the OPERATOR FIELD1 of VALUE1",
    "Show me the NUMBER ROW_NAME with the OPERATOR FIELD1 of VALUE1 and VALUE2",
    "Show me the FIELD1 with the OPERATOR FIELD2",
    "Show me the FIELD1 with the OPERATOR FIELD2 of VALUE1",
    "Show me the FIELD1 with the OPERATOR FIELD2 of VALUE1 and VALUE2",
    "Give me the NUMBER FIELD1 with the OPERATOR FIELD2",
    "Give me the NUMBER FIELD1 with the OPERATOR FIELD2 of VALUE1",
    "Give me the NUMBER FIELD1 with the OPERATOR FIELD2 of VALUE1 and VALUE2",
    "Who are the individuals with VALUE1?",
    "Who are the individuals with VALUE1 of VALUE2?",
    "Give me the ROW_NAME of individuals with VALUE1",
    "Give me the ROW_NAME of individuals with VALUE1 and VALUE2",
    "What is the FIELD1 for those with VALUE1?",
    "What is the FIELD1 for those with VALUE1 and VALUE2?",
    "What is the OPERATOR value for FIELD1?",
    "What is the OPERATOR value for FIELD1 of individuals with VALUE1?",
    "What is the OPERATOR value for FIELD1 of individuals with VALUE1 and VALUE2?",
    "Show me the NUMBER individuals with OPERATOR FIELD1",
    "Show me the NUMBER individuals with OPERATOR FIELD1 of VALUE1",
    "Show me the NUMBER individuals with OPERATOR FIELD1 of VALUE1 and VALUE2"
  ]
}